src/InformationRegisters/Инциденты/Инциденты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Инциденты</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнцидентов</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееСрабатывание</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЧислоСрабатываний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформационнаяБаза</name>
    <comment>Инфобаза или название счетчика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кластер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ПодробноеСообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРеакции</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НеОповещатьДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПроигнорироватьДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОткрытияПовторная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЧислоСрабатыванийПовторное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникИнцидента</name>
    <type>
      <types>CatalogRef.ОбнаружениеИнцидентовОперативное</types>
      <types>String</types>
      <types>CatalogRef.ПоказателиСчетчиков</types>
      <types>CatalogRef.ГруппыСчетчиков</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НавигационнаяСсылкаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеНавигационнойСсылкиИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инцидент</name>
    <type>
      <types>CatalogRef.Инциденты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/УровниИнцидентов/УровниИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниИнцидентов</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>КритическаяОшибка</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ТипыИнцидентов/ТипыИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыИнцидентов</name>
  <attributes>
    <name>Подсистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокАдм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЦКК</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ОбнаружениеИнцидентов</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешТипа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/Инциденты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьТекстЗапросаИнициализацииСКД_Оперативное() Экспорт
    
    Возврат "
    |ВЫБРАТЬ
    |   РегСвИнциденты.Инцидент КАК Инцидент,
    |   РегСвИнциденты.ТипИнцидента КАК ТипИнцидента,
    |   Инциденты.Наименование КАК НаименованиеИнцидента,
    |   ТипыИнцидентов.Наименование КАК НаименованиеТипаИнцидента,
    |   Инциденты.ПометкаУдаления КАК ПометкаУдаленияИнцидента,
    |   ТипыИнцидентов.ПометкаУдаления КАК ПометкаУдаленияТипаИнцидента,
    |   ЗНАЧЕНИЕ(Перечисление.УровниИнцидентов.Информация) КАК УровеньИнцидента
    |ИЗ
    |   РегистрСведений.Инциденты КАК РегСвИнциденты
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.Инциденты КАК Инциденты
    |ПО
    |   Инциденты.Ссылка = РегСвИнциденты.Инцидент
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   Справочник.ТипыИнцидентов КАК ТипыИнцидентов
    |ПО
    |   ТипыИнцидентов.Ссылка = РегСвИнциденты.ТипИнцидента
    |";
    
КонецФункции

Функция ПолучитьТекстЗапросаИнициализацииСКД() Экспорт
    
    Возврат "
    |ВЫБРАТЬ
    |   СпрИнциденты.Ссылка КАК ИнцидентСсылка,
    |   СпрИнциденты.Наименование КАК КодИнцидента,
    |   РегСвИнциденты.ТипИнцидента КАК ТипИнцидента,
    |   РегСвИнциденты.Статус КАК Статус,
    |   РегСвИнциденты.ПоследнееСрабатывание КАК ПоследнееСрабатывание,
    |   РегСвИнциденты.ДатаЗакрытия КАК ДатаЗакрытия,
    |   РегСвИнциденты.ЧислоСрабатываний КАК ЧислоСрабатываний,
    |   РегСвИнциденты.ИнформационнаяБаза КАК ИнформационнаяБаза,
    |   РегСвИнциденты.Кластер КАК Кластер,
    |   РегСвИнциденты.Ответственный КАК Ответственный,
    |   РегСвИнциденты.ПодробноеСообщение КАК ПодробноеСообщение,
    |   РегСвИнциденты.ДатаРеакции КАК ДатаРеакции,
    |   РегСвИнциденты.НеОповещатьДо КАК НеОповещатьДо,
    |   РегСвИнциденты.ПроигнорироватьДо КАК ПроигнорироватьДо,
    |   РегСвИнциденты.ДатаОткрытияПовторная КАК ДатаОткрытияПовторная,
    |   РегСвИнциденты.ЧислоСрабатыванийПовторное КАК ЧислоСрабатыванийПовторное,
    |   РегСвИнциденты.УровеньИнцидента КАК УровеньИнцидента
    |ИЗ
    |   Справочник.Инциденты КАК СпрИнциденты
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   РегистрСведений.Инциденты КАК РегСвИнциденты
    |ПО
    |   РегСвИнциденты.Инцидент = СпрИнциденты.Ссылка
    |";
    
КонецФункции

Функция ПолучитьТекстЗапросаВыбратьЗаписи() Экспорт
    
    Возврат "
    |ВЫБРАТЬ
    |   СпрИнциденты.Ссылка КАК ИнцидентСсылка,
    |   СпрИнциденты.Наименование КАК КодИнцидента,
    |   РегСвИнциденты.ТипИнцидента КАК ТипИнцидента,
    |   РегСвИнциденты.Статус КАК Статус,
    |   РегСвИнциденты.ПоследнееСрабатывание КАК ПоследнееСрабатывание,
    |   РегСвИнциденты.ДатаЗакрытия КАК ДатаЗакрытия,
    |   РегСвИнциденты.ЧислоСрабатываний КАК ЧислоСрабатываний,
    |   РегСвИнциденты.ИнформационнаяБаза КАК ИнформационнаяБаза,
    |   РегСвИнциденты.Кластер КАК Кластер,
    |   РегСвИнциденты.Ответственный КАК Ответственный,
    |   РегСвИнциденты.ПодробноеСообщение КАК ПодробноеСообщение,
    |   РегСвИнциденты.ДатаРеакции КАК ДатаРеакции,
    |   РегСвИнциденты.НеОповещатьДо КАК НеОповещатьДо,
    |   РегСвИнциденты.ПроигнорироватьДо КАК ПроигнорироватьДо,
    |   РегСвИнциденты.ДатаОткрытияПовторная КАК ДатаОткрытияПовторная,
    |   РегСвИнциденты.ЧислоСрабатыванийПовторное КАК ЧислоСрабатыванийПовторное,
    |   РегСвИнциденты.УровеньИнцидента КАК УровеньИнцидента
    |ИЗ
    |   Справочник.Инциденты КАК СпрИнциденты
    |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
    |   РегистрСведений.Инциденты КАК РегСвИнциденты
    |ПО
    |   РегСвИнциденты.Инцидент = СпрИнциденты.Ссылка
    |";
    
КонецФункции

Процедура УдалитьПоТипуИнцидента(ТипИнцидента) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Инцидент,
    |   ТипИнцидента
	|ИЗ
	|	РегистрСведений.Инциденты
	|ГДЕ
	|	ТипИнцидента = &ТипИнцидента
	|";
	
	Запрос.УстановитьПараметр("ТипИнцидента", ТипИнцидента);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = ПолучитьМенеджерЗаписи(Выборка.Инцидент, Выборка.ТипИнцидента);
		Запись.Удалить();
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьМенеджерЗаписи(Знач Инцидент, Знач ТипИнцидента) Экспорт
    
    Если ТипЗнч(Инцидент) = Тип("Строка") Тогда
        Инцидент = Справочники.Инциденты.НайтиСсылкуПоНаименованию(Инцидент);
    КонецЕсли;
       
	МенеджерЗаписи = РегистрыСведений.Инциденты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Инцидент = Инцидент;
    МенеджерЗаписи.ТипИнцидента = ТипИнцидента;
	МенеджерЗаписи.Прочитать();
		
	Возврат МенеджерЗаписи;
	
КонецФункции

// Функция - Статус
//
// Параметры:
//  ТипИнцидента - СправочникСсылка.ТипИнцидента      - тип инцидента для отбора.
//  Инцидент     - СправочникСсылка.Инциденты, Строка - инцидент для отбора.
// 
// Возвращаемое значение:
//  Статус - ПеречислениеСсылка.СтатусыИнцидентов 
//
Функция Статус(ТипИнцидента, Инцидент) Экспорт
    
    Статус = Неопределено;
    
    Запрос = Новый Запрос;
    
    Если ТипЗнч(Инцидент) = Тип("СправочникСсылка.Инциденты") Тогда
        Запрос.Текст = "
        |ВЫБРАТЬ
        |   Статус
        |ИЗ
        |   РегистрСведений.Инциденты
        |ГДЕ
        |   Инцидент = &Инцидент
        |   И ТипИнцидента = &ТипИнцидента
        |";
    Иначе
        Запрос.Текст = "
        |ВЫБРАТЬ
        |   Рег.Статус
        |ИЗ
        |   Справочник.Инциденты КАК Спр
        |ВНУТРЕННЕЕ СОЕДИНЕНИЕ
        |   РегистрСведений.Инциденты КАК Рег
        |ПО
        |   Рег.Инцидент = Спр.Ссылка
        |   И Рег.ТипИнцидента = &ТипИнцидента
        |ГДЕ
        |   Наименование = &Инцидент
        |";
    КонецЕсли;
    
    Запрос.УстановитьПараметр("Инцидент", Инцидент);
    Запрос.УстановитьПараметр("ТипИнцидента", ТипИнцидента);
    
    Результат = Запрос.Выполнить();
    Если НЕ Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Статус = Выборка.Статус;
    КонецЕсли;
    
    Возврат Статус;
    
КонецФункции

#КонецОбласти

#КонецЕсли
